In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [3]:
np.random.seed(101)

In [4]:
df = pd.DataFrame(randn(5,6),['a','b','c','d','e'],['z','y','x','w','v','u'])

In [5]:
df

          z         y         x         w         v         u
a  2.706850  0.628133  0.907969  0.503826  0.651118 -0.319318
b -0.848077  0.605965 -2.018168  0.740122  0.528813 -0.589001
c  0.188695 -0.758872 -0.933237  0.955057  0.190794  1.978757
d  2.605967  0.683509  0.302665  1.693723 -1.706086 -1.159119
e -0.134841  0.390528  0.166905  0.184502  0.807706  0.072960

In [6]:
df['z']

a    2.706850
b   -0.848077
c    0.188695
d    2.605967
e   -0.134841
Name: z, dtype: float64

In [7]:
df['y']

a    0.628133
b    0.605965
c   -0.758872
d    0.683509
e    0.390528
Name: y, dtype: float64

In [8]:
type(df['z'])

pandas.core.series.Series

In [9]:
type(df)

pandas.core.frame.DataFrame

In [10]:
df.z

a    2.706850
b   -0.848077
c    0.188695
d    2.605967
e   -0.134841
Name: z, dtype: float64

In [11]:
df[['z','y']]

          z         y
a  2.706850  0.628133
b -0.848077  0.605965
c  0.188695 -0.758872
d  2.605967  0.683509
e -0.134841  0.390528

In [12]:
df['new'] = df['z'] + df['y']

In [13]:
df

          z         y         x         w         v         u       new
a  2.706850  0.628133  0.907969  0.503826  0.651118 -0.319318  3.334983
b -0.848077  0.605965 -2.018168  0.740122  0.528813 -0.589001 -0.242112
c  0.188695 -0.758872 -0.933237  0.955057  0.190794  1.978757 -0.570177
d  2.605967  0.683509  0.302665  1.693723 -1.706086 -1.159119  3.289476
e -0.134841  0.390528  0.166905  0.184502  0.807706  0.072960  0.255687

In [14]:
df.drop('new',axis=1)

          z         y         x         w         v         u
a  2.706850  0.628133  0.907969  0.503826  0.651118 -0.319318
b -0.848077  0.605965 -2.018168  0.740122  0.528813 -0.589001
c  0.188695 -0.758872 -0.933237  0.955057  0.190794  1.978757
d  2.605967  0.683509  0.302665  1.693723 -1.706086 -1.159119
e -0.134841  0.390528  0.166905  0.184502  0.807706  0.072960

In [15]:
df

          z         y         x         w         v         u       new
a  2.706850  0.628133  0.907969  0.503826  0.651118 -0.319318  3.334983
b -0.848077  0.605965 -2.018168  0.740122  0.528813 -0.589001 -0.242112
c  0.188695 -0.758872 -0.933237  0.955057  0.190794  1.978757 -0.570177
d  2.605967  0.683509  0.302665  1.693723 -1.706086 -1.159119  3.289476
e -0.134841  0.390528  0.166905  0.184502  0.807706  0.072960  0.255687

In [16]:
df.drop('new',axis=1,inplace=True)  #because of Inplace value

In [17]:
df

          z         y         x         w         v         u
a  2.706850  0.628133  0.907969  0.503826  0.651118 -0.319318
b -0.848077  0.605965 -2.018168  0.740122  0.528813 -0.589001
c  0.188695 -0.758872 -0.933237  0.955057  0.190794  1.978757
d  2.605967  0.683509  0.302665  1.693723 -1.706086 -1.159119
e -0.134841  0.390528  0.166905  0.184502  0.807706  0.072960

In [18]:
df

          z         y         x         w         v         u
a  2.706850  0.628133  0.907969  0.503826  0.651118 -0.319318
b -0.848077  0.605965 -2.018168  0.740122  0.528813 -0.589001
c  0.188695 -0.758872 -0.933237  0.955057  0.190794  1.978757
d  2.605967  0.683509  0.302665  1.693723 -1.706086 -1.159119
e -0.134841  0.390528  0.166905  0.184502  0.807706  0.072960

In [59]:
df.drop('e')

          z         y         x         w         v         u
a  2.706850  0.628133  0.907969  0.503826  0.651118 -0.319318
b -0.848077  0.605965 -2.018168  0.740122  0.528813 -0.589001
c  0.188695 -0.758872 -0.933237  0.955057  0.190794  1.978757
d  2.605967  0.683509  0.302665  1.693723 -1.706086 -1.159119

In [19]:
df.shape

(5, 6)

In [20]:
df.drop('e',inplace = True)
df

          z         y         x         w         v         u
a  2.706850  0.628133  0.907969  0.503826  0.651118 -0.319318
b -0.848077  0.605965 -2.018168  0.740122  0.528813 -0.589001
c  0.188695 -0.758872 -0.933237  0.955057  0.190794  1.978757
d  2.605967  0.683509  0.302665  1.693723 -1.706086 -1.159119

In [21]:
df.shape

(4, 6)

In [ ]:
#rows

In [22]:
df

          z         y         x         w         v         u
a  2.706850  0.628133  0.907969  0.503826  0.651118 -0.319318
b -0.848077  0.605965 -2.018168  0.740122  0.528813 -0.589001
c  0.188695 -0.758872 -0.933237  0.955057  0.190794  1.978757
d  2.605967  0.683509  0.302665  1.693723 -1.706086 -1.159119

In [23]:
df

          z         y         x         w         v         u
a  2.706850  0.628133  0.907969  0.503826  0.651118 -0.319318
b -0.848077  0.605965 -2.018168  0.740122  0.528813 -0.589001
c  0.188695 -0.758872 -0.933237  0.955057  0.190794  1.978757
d  2.605967  0.683509  0.302665  1.693723 -1.706086 -1.159119

In [24]:
df.loc['a']

z    2.706850
y    0.628133
x    0.907969
w    0.503826
v    0.651118
u   -0.319318
Name: a, dtype: float64

In [25]:
df.iloc[0]

z    2.706850
y    0.628133
x    0.907969
w    0.503826
v    0.651118
u   -0.319318
Name: a, dtype: float64

In [26]:
df.loc['a','z']

2.706849839399938

In [27]:
df.loc[['a','d'],['w','z']]

          w         z
a  0.503826  2.706850
d  1.693723  2.605967

In [28]:
df>0

       z      y      x     w      v      u
a   True   True   True  True   True  False
b  False   True  False  True   True  False
c   True  False  False  True   True   True
d   True   True   True  True  False  False

In [29]:
df<1

       z     y     x      w     v      u
a  False  True  True   True  True   True
b   True  True  True   True  True   True
c   True  True  True   True  True  False
d  False  True  True  False  True   True

In [30]:
df>1

       z      y      x      w      v      u
a   True  False  False  False  False  False
b  False  False  False  False  False  False
c  False  False  False  False  False   True
d   True  False  False   True  False  False

In [31]:
bool = df>0

In [32]:
df[bool]

          z         y         x         w         v         u
a  2.706850  0.628133  0.907969  0.503826  0.651118       NaN
b       NaN  0.605965       NaN  0.740122  0.528813       NaN
c  0.188695       NaN       NaN  0.955057  0.190794  1.978757
d  2.605967  0.683509  0.302665  1.693723       NaN       NaN

In [33]:
df['z']>0

a     True
b    False
c     True
d     True
Name: z, dtype: bool

In [34]:
df['z']

a    2.706850
b   -0.848077
c    0.188695
d    2.605967
Name: z, dtype: float64

In [35]:
df[df['z']>0]

          z         y         x         w         v         u
a  2.706850  0.628133  0.907969  0.503826  0.651118 -0.319318
c  0.188695 -0.758872 -0.933237  0.955057  0.190794  1.978757
d  2.605967  0.683509  0.302665  1.693723 -1.706086 -1.159119

In [36]:
df[df['v']<0]

          z         y         x         w         v         u
d  2.605967  0.683509  0.302665  1.693723 -1.706086 -1.159119

In [37]:
resuly = df[df['w']>0]

In [38]:
resuly

          z         y         x         w         v         u
a  2.706850  0.628133  0.907969  0.503826  0.651118 -0.319318
b -0.848077  0.605965 -2.018168  0.740122  0.528813 -0.589001
c  0.188695 -0.758872 -0.933237  0.955057  0.190794  1.978757
d  2.605967  0.683509  0.302665  1.693723 -1.706086 -1.159119

In [39]:
df[df['z']>0]['v']

a    0.651118
c    0.190794
d   -1.706086
Name: v, dtype: float64

In [40]:
df[df['z']>0][['v','x']]

          v         x
a  0.651118  0.907969
c  0.190794 -0.933237
d -1.706086  0.302665

In [41]:
bool = df['y']>0

In [42]:
result = df[bool]

In [43]:
result

          z         y         x         w         v         u
a  2.706850  0.628133  0.907969  0.503826  0.651118 -0.319318
b -0.848077  0.605965 -2.018168  0.740122  0.528813 -0.589001
d  2.605967  0.683509  0.302665  1.693723 -1.706086 -1.159119

In [44]:
mycol = ['y','x']

In [45]:
result[mycol]

          y         x
a  0.628133  0.907969
b  0.605965 -2.018168
d  0.683509  0.302665

In [46]:
df

          z         y         x         w         v         u
a  2.706850  0.628133  0.907969  0.503826  0.651118 -0.319318
b -0.848077  0.605965 -2.018168  0.740122  0.528813 -0.589001
c  0.188695 -0.758872 -0.933237  0.955057  0.190794  1.978757
d  2.605967  0.683509  0.302665  1.693723 -1.706086 -1.159119

In [47]:
df[(df['x']>0) & (df['w']<1)]

         z         y         x         w         v         u
a  2.70685  0.628133  0.907969  0.503826  0.651118 -0.319318

In [48]:
df[(df['x']>0) | (df['w']<1)]

          z         y         x         w         v         u
a  2.706850  0.628133  0.907969  0.503826  0.651118 -0.319318
b -0.848077  0.605965 -2.018168  0.740122  0.528813 -0.589001
c  0.188695 -0.758872 -0.933237  0.955057  0.190794  1.978757
d  2.605967  0.683509  0.302665  1.693723 -1.706086 -1.159119

In [49]:
df

          z         y         x         w         v         u
a  2.706850  0.628133  0.907969  0.503826  0.651118 -0.319318
b -0.848077  0.605965 -2.018168  0.740122  0.528813 -0.589001
c  0.188695 -0.758872 -0.933237  0.955057  0.190794  1.978757
d  2.605967  0.683509  0.302665  1.693723 -1.706086 -1.159119

In [50]:
df.reset_index()

  index         z         y         x         w         v         u
0     a  2.706850  0.628133  0.907969  0.503826  0.651118 -0.319318
1     b -0.848077  0.605965 -2.018168  0.740122  0.528813 -0.589001
2     c  0.188695 -0.758872 -0.933237  0.955057  0.190794  1.978757
3     d  2.605967  0.683509  0.302665  1.693723 -1.706086 -1.159119

In [51]:
df.reset_index(inplace = True)

In [52]:
df.reset_index()

   level_0 index         z         y         x         w         v         u
0        0     a  2.706850  0.628133  0.907969  0.503826  0.651118 -0.319318
1        1     b -0.848077  0.605965 -2.018168  0.740122  0.528813 -0.589001
2        2     c  0.188695 -0.758872 -0.933237  0.955057  0.190794  1.978757
3        3     d  2.605967  0.683509  0.302665  1.693723 -1.706086 -1.159119

In [53]:
df

  index         z         y         x         w         v         u
0     a  2.706850  0.628133  0.907969  0.503826  0.651118 -0.319318
1     b -0.848077  0.605965 -2.018168  0.740122  0.528813 -0.589001
2     c  0.188695 -0.758872 -0.933237  0.955057  0.190794  1.978757
3     d  2.605967  0.683509  0.302665  1.693723 -1.706086 -1.159119

In [57]:
newind = 'ff gg hh ii'.split()

In [58]:
newind

['ff', 'gg', 'hh', 'ii']

In [59]:
 df['states'] = newind

In [60]:
df

  index         z         y         x         w         v         u states
0     a  2.706850  0.628133  0.907969  0.503826  0.651118 -0.319318     ff
1     b -0.848077  0.605965 -2.018168  0.740122  0.528813 -0.589001     gg
2     c  0.188695 -0.758872 -0.933237  0.955057  0.190794  1.978757     hh
3     d  2.605967  0.683509  0.302665  1.693723 -1.706086 -1.159119     ii

In [61]:
df.set_index('states')

       index         z         y         x         w         v         u
states
ff         a  2.706850  0.628133  0.907969  0.503826  0.651118 -0.319318
gg         b -0.848077  0.605965 -2.018168  0.740122  0.528813 -0.589001
hh         c  0.188695 -0.758872 -0.933237  0.955057  0.190794  1.978757
ii         d  2.605967  0.683509  0.302665  1.693723 -1.706086 -1.159119

In [62]:
df

  index         z         y         x         w         v         u states
0     a  2.706850  0.628133  0.907969  0.503826  0.651118 -0.319318     ff
1     b -0.848077  0.605965 -2.018168  0.740122  0.528813 -0.589001     gg
2     c  0.188695 -0.758872 -0.933237  0.955057  0.190794  1.978757     hh
3     d  2.605967  0.683509  0.302665  1.693723 -1.706086 -1.159119     ii

In [65]:
df.set_index('states',inplace= True)

In [66]:
df

       index         z         y         x         w         v         u
states
ff         a  2.706850  0.628133  0.907969  0.503826  0.651118 -0.319318
gg         b -0.848077  0.605965 -2.018168  0.740122  0.528813 -0.589001
hh         c  0.188695 -0.758872 -0.933237  0.955057  0.190794  1.978757
ii         d  2.605967  0.683509  0.302665  1.693723 -1.706086 -1.159119

In [67]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [68]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [69]:
inside

[1, 2, 3, 1, 2, 3]

In [70]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [72]:
df =pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [73]:
df

             A         B
G1 1 -1.136645  0.000366
   2  1.025984 -0.156598
   3 -0.031579  0.649826
G2 1  2.154846 -0.610259
   2 -0.755325 -0.346419
   3  0.147027 -0.479448

In [74]:
df.loc['G1']

          A         B
1 -1.136645  0.000366
2  1.025984 -0.156598
3 -0.031579  0.649826

In [76]:
df.loc['G1',1]

A   -1.136645
B    0.000366
Name: (G1, 1), dtype: float64

In [81]:
df.index.names = ['Groups', 'Num']

In [82]:
df

                   A         B
Groups Num
G1     1   -1.136645  0.000366
       2    1.025984 -0.156598
       3   -0.031579  0.649826
G2     1    2.154846 -0.610259
       2   -0.755325 -0.346419
       3    0.147027 -0.479448

In [84]:
df.loc['G1'].loc[2,'B']

-0.1565979042889875

In [87]:
df.xs('G1')

            A         B
Num
1   -1.136645  0.000366
2    1.025984 -0.156598
3   -0.031579  0.649826

In [88]:
 df.xs(1,level ='Num')

               A         B
Groups
G1     -1.136645  0.000366
G2      2.154846 -0.610259